Merge pull request #8 from paoloSalazar/MBRA-52-Manage-Event-Payments
Mbra 52 manage event payments
